# Creating views 1

In this exercise, we learn how to create different types of views and how to drop views.

Ensure that you have downloaded the database file Chinook.db.

# Learning objectives
By the end of this train, you should be able to:

Create LOOKUP, JOIN, and AGGREGATING views.
Drop a view.

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

In [2]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

Connecting to 'sqlite:///chinook.db'

## Exercise

Run the necessary queries that will provide us with the following information. 
    
Compare your queries with the solutions at the end of this notebook.

## Exercise 1

Create a LOOKUP view of the surname, first name, title, and country of each employee called Employee_View.

In [4]:
%%sql 

CREATE VIEW Employee_View 
AS
    
SELECT 
    FirstName,
    LastName,
    Title,
    Country
FROM
    employees;

Running query in 'sqlite:///chinook.db'

++
||
++
++

## Exercise 2
Query the Employee_View view to get a view of the sales team.

Use the wildcard operators and the LIKE query to filter all the employees in the specified view.

In [10]:
%%sql

SELECT * 
    
FROM
    Employee_View
WHERE 
    Title LIKE '%Sales%';

Running query in 'sqlite:///chinook.db'

+-----------+----------+---------------------+---------+
| FirstName | LastName |        Title        | Country |
+-----------+----------+---------------------+---------+
|   Nancy   | Edwards  |    Sales Manager    |  Canada |
|    Jane   | Peacock  | Sales Support Agent |  Canada |
|  Margaret |   Park   | Sales Support Agent |  Canada |
|   Steve   | Johnson  | Sales Support Agent |  Canada |
+-----------+----------+---------------------+---------+

## Exercise 3
Create a JOIN view that will link up all the customers with the support staff assisting them, called Customer_Support_View. 

We want to view the following:

First name of the customer

Last name (surname) of the customer

Country where the customer resides

SupportRepId

EmployeeId

Last name of the employee

First name of the employee

Job title of the employee

Country where the employee operated from

In [15]:
%%sql 
CREATE VIEW Customer_Support_View 
AS 
    
SELECT 
    c.FirstName,
    c.LastName,
    c.Country,
    c.SupportRepId,
    e.EmployeeId,
    e.LastName as Employee_firstName,
    e.FirstName as Employee_lastName,
    e.Title

FROM 
    customers as c

JOIN 
    employees as e

ON 
    c.SupportRepId = e.EmployeeId ;

Running query in 'sqlite:///chinook.db'

++
||
++
++

## Exercise 4
Query the Customer_Support_View view to get a list of the names and surnames of the clients who were helped by an employee with the Employeeid '3'.

In [17]:
%%sql 

SELECT 
    FirstName,
    LastName

FROM
    Customer_Support_View
WHERE
    employeeId = 3 ;

Running query in 'sqlite:///chinook.db'

+-----------+-----------+
| FirstName |  LastName |
+-----------+-----------+
|    Luís   | Gonçalves |
|  François |  Tremblay |
|  Roberto  |  Almeida  |
|  Jennifer |  Peterson |
|  Michelle |   Brooks  |
|    Tim    |   Goyer   |
|   Frank   |  Ralston  |
|   Robert  |   Brown   |
|   Edward  |  Francis  |
|   Ellie   |  Sullivan |
+-----------+-----------+
Truncated to displaylimit of 10.

## Exercise 5
Create an AGGREGATING view that counts the number of customers that are currently being serviced per country, called Customer_per_Country_View.

We would like to see the country name and the number of customers in this view.

In [20]:
%%sql
CREATE VIEW Customer_Per_Country_View
AS
    
SELECT 
    Country,
    COUNT(CustomerId) as No_of_customers
FROM 
    customers
GROUP BY 
    Country ;

Running query in 'sqlite:///chinook.db'

++
||
++
++

## Exercise 6
Write a query that returns the country with the most customers from Customer_per_Country_View.

In [22]:
%%sql 

SELECT 
    Country,
    MAX(no_of_customers)
FROM 
    Customer_Per_Country_View;

Running query in 'sqlite:///chinook.db'

+---------+----------------------+
| Country | MAX(no_of_customers) |
+---------+----------------------+
|   USA   |          13          |
+---------+----------------------+

## Exercise 7
Write a query that will delete the Employee_View view.

%%sql 

DROP VIEW Employee_View

## Challenge question
Write a query that returns the number of customers that each support employee services, along with the name of the employee. Call this view Support_Person_Stats.

To do this, we will need to create a view, join the Customer and Employee tables, and use the COUNT and GROUP BY functions to aggregate the number of employees serviced by each employee.

In [31]:
%%sql

CREATE VIEW Support_Person_Stats
AS 
    
SELECT 
    COUNT(c.SupportRepId) Count_of_Customers_Serviced , 
    e.EmployeeId, e.LastName
    
FROM 
    customers c
INNER JOIN 
    employees e
ON 
    c.SupportRepId = e.EmployeeId

GROUP BY e.EmployeeId;

Running query in 'sqlite:///chinook.db'

++
||
++
++